<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>이용 약관</title>
</head>
<body>
<h2>요기콕 에 오신 것을 환영합니다!</h2>
당사가 명시적으로 별도의 약관(본 약관이 아님)이 적용된다고 밝히지 않는 한 본 이용 약관(또는 '약관')이 귀하의 요기콕 사용에 적용되며 아래 설명된 요기콕 서비스('서비스')에 대한 정보를 제공합니다.<br> 
귀하가 요기콕 계정을 만들거나 요기콕을 이용하는 경우, 귀하는 본 약관에 동의하는 것으로 간주됩니다. <br>
요기콕 서비스 약관은 이 서비스에 적용되지 않습니다.<br>
요기콕 서비스는 HINPL에서 귀하에게 제공하는 HINPL 제품 중 하나입니다. 따라서 본 이용 약관은 귀하와 HINPL inc. 사이의 계약에 해당됩니다.<br>
<br>


<ul>
<h3>요기콕을 이용할 수 있는 주체.</h3><br>
당사는 요기콕 서비스가 가능한 개방적이고 포괄적인 서비스가 되기를 원하지만, 또한 본 서비스가 안전하고, 보안성을 갖추며, 법을 준수하는 서비스가 되기를 원합니다. <br>
따라서 귀하가 요기콕 커뮤니티에 참여하려면 몇 가지 제한 사항을 준수해야 합니다.<br>
<br>
<li>만 14세 이상이어야 합니다.</li>
<li>관련 법률에 따라 요기콕 서비스를 받는 것이 금지된 사람 또는 관련 제재 대상 명단에 있어 결제 관련 요기콕 서비스를 이용하는 것이 금지된 사람이 아니어야 합니다.</li>
<li>과거에 당사가 귀하의 계정을 법률 또는 요기콕 정책 위반을 이유로 하여 비활성화한 적이 없어야 합니다.</li>
<li>유죄 확정판결을 받은 성범죄자가 아니어야 합니다.</li>
</ul>
<br>
<ul>
<h3>귀하가 당사에 부여한 권한.</h3> 본 계약의 일부로서, 귀하는 또한 당사가 귀하에게 서비스를 제공하기 위해 필요로 하는 권한을 당사에 부여합니다.<br>
<br>
<li><b>당사가 귀하의 콘텐츠에 대한 소유권을 주장하지 않는 것과는 별개로, 귀하는 당사에 귀하 콘텐츠 이용을 허용하는 라이선스를 부여합니다.</b>
귀하의 콘텐츠에 대한 귀하의 권리에 있어 변경되는 사항은 없습니다. 당사는 서비스에 또는 서비스를 통해 귀하가 게시하는 콘텐츠에 대한 소유권을 주장하지 않으며 귀하는 원하는 곳 어디에서나 다른 사람들과 자유롭게 콘텐츠를 공유할 수 있습니다. 
그러나 당사가 서비스를 제공하기 위해서는 귀하로부터 특정 법적 권한('라이선스')을 부여받아야 합니다. 
귀하가 지식 재산권(사진 또는 동영상 등)이 적용되는 콘텐츠 또는 당사 서비스와 관련된 콘텐츠를 공유, 게시 또는 업로드할 때, 귀하는 귀하의 콘텐츠를 전 세계적으로 호스팅, 사용, 배포, 수정, 실행, 복사, 공개적으로 수행 또는 표시, 번역 및 그 파생 저작물을 생성할 수 있는 비독점적이고 양도 가능하며 2차 라이선스를 가질 수 있고 사용료가 없는 라이선스를 당사에 부여합니다(귀하의 개인정보 처리방침 및 애플리케이션 설정과 일치함). 
이러한 라이선스는 당사 서비스에 접속하고 이를 이용하는 귀하 및 다른 사람들에게 당사 서비스 이용을 가능하게 하기 위한 것입니다. 
귀하는 귀하의 콘텐츠를 개별적으로 삭제하거나, 계정 삭제를 통해 한 번에 모두 삭제할 수 있습니다. 
당사의 정보 사용 방법과 콘텐츠 관리 또는 삭제 방법에 관한 자세한 내용을 확인하시려면, <a href="datapolicy.jsp">데이터 정책</a>을 살펴보시고 <a href="servicecenter.jsp">고객센터</a>를 방문하세요.</li>
<li>귀하는 당사가 귀하의 기기에서 서비스 업데이트를 다운로드하고 설치할 수 있다는 것에 동의합니다.</li>
</ul>

<br>
<ul>
<li>귀하가 서비스에서 공유하는 콘텐츠나 정보가 본 이용 약관, 당사 정책(당사  <a href="commuguideline.jsp">요기콕 커뮤니티 가이드라인</a>포함)에 위배된다고 판단되거나 법에 따라 삭제해야 할 경우, 당사는 이를 삭제할 수 있습니다. 
 당사 커뮤니티 또는 서비스를 보호하기 위해 또는 귀하가 당사에 위험 또는 법적 문제를 일으키거나, 본 약관 또는 당사 정책(당사 <a href="commuguideline.jsp">요기콕 커뮤니티 가이드라인</a>포함)을 위반하거나, 다른 사람의 지식 재산권을 반복적으로 침해하거나, 법률에 따라 허용되거나 요구되는 경우에 귀하에게 서비스 전부 또는 일부를 제공하는 것을 즉시 중단하거나 거부할 수 있습니다(귀하의 HINPL 제품 및 HINPL 제품 액세스 해지 또는 비활성화 포함). 
 당사에 법적으로 불리하거나 규제적 영향을 끼치는 상황을 피하거나 줄이기 위해 필요하다고 합리적으로 판단되면, 당사는 서비스를 해지 또는 변경하거나, 서비스에서 공유된 콘텐츠 또는 정보를 삭제 또는 차단하거나, 서비스 전부 또는 일부를 제공하는 것을 중단할 수 있습니다. 
 귀하의 계정이 오류로 인해 해지되었다고 생각되는 경우 또는 귀하의 계정을 비활성화하거나 영구 삭제하고 싶은 경우에는 당사  <a href="servicecenter.jsp">고객센터</a>로 문의하세요. 
 콘텐츠 또는 계정의 삭제를 요청하는 경우 삭제 프로세스는 요청 후 30일 이내에 자동으로 시작됩니다. 
 삭제 프로세스가 시작된 후 콘텐츠 삭제에는 최대 90일이 걸릴 수 있습니다. 
 이러한 콘텐츠 삭제 프로세스가 진행되는 동안 콘텐츠는 사용자에게 표시되지 않지만 계속해서 본 이용 약관 및 데이터 정책의 적용을 받습니다. 
 콘텐츠가 삭제된 후에는 백업과 재난 복구 시스템에서 제거하는 데 90일이 더 걸릴 수 있습니다.</li>
<li>다음과 같은 경우 콘텐츠는 계정 삭제 후 또는 콘텐츠 삭제 프로세스가 시작된 후 90일 이내에 삭제되지 않습니다.</li>
<ul>
<li>다른 사람이 이 라이선스에 따라 콘텐츠를 사용하였고 아직 삭제하지 않은 경우(이 경우 콘텐츠가 삭제될 때까지 이 라이선스가 계속 적용됨) 또는</li>
<li>당사 시스템의 기술적 제한으로 인해 90일 이내 삭제가 가능하지 않은 경우(그리고 그러한 경우 당사는 기술적으로 가능해지는 즉시 콘텐츠를 삭제함) 또는</li>
<li>즉시 삭제할 경우 다음과 같은 당사의 조치가 제한될 수 있는 경우</li>
<ul>
<li>불법 활동 또는 당사 약관 및 정책 위반 사항에 대한 조사 또는 규명(예: 당사 제품 또는 시스템 오용 사례의 조사 또는 규명)</li>
<li>당사 제품, 시스템, 사용자의 안전 및 보안 보호</li>
<li>증거 보존 등 법적 의무의 준수 또는</li>
<li>사법 또는 행정 당국, 법 집행 기관 또는 정부 기관의 요청 준수;</li>
</ul>
<li>이 경우, 콘텐츠는 콘텐츠 유지 목적을 위해 필요한 기간 동안에만 유지됩니다(정확한 기간은 사례별로 다름).</li>
</ul>
<li>귀하가 계정을 삭제하거나 비활성화하면 본 약관은 귀하와 당사의 계약과 마찬가지로 해지되나, 본 조항 및 아래 조항('계약 및 상호 의견이 합치되지 않는 경우')은 계정이 해지, 비활성화 또는 삭제된 후에도 여전히 적용됩니다.</li>
</ul>
<br>
<ul>
<h3>당사와의 계약.</h3><br>
<li>서비스를 통한 귀하의 음악 사용 역시 당사 뮤직 가이드라인의 적용을 받으며, 귀하의 당사 API 사용에는 당사의 HINPL 플랫폼 약관 및 개발자 정책이 적용됩니다. 귀하가 기타 특정 기능 또는 관련 서비스를 이용하는 경우, 귀하는 추가 약관에 대해 동의할 기회를 제공받으며, 추가 약관은 당사와 귀하 간의 합의 일부를 구성합니다. 추가 약관이 본 계약과 상충될 경우 추가 약관이 우선합니다.
<li>본 계약의 일부가 이행 불가능한 경우에도, 나머지 부분은 계속해서 효력을 갖습니다.</li>
<li>본 계약의 개정이나 면제는 당사가 작성하고 서명한 서면으로만 가능합니다. 당사가 본 계약의 일부를 이행하지 못하더라도, 이는 계약의 포기로 간주되지 않습니다.</li>
<li>당사는 귀하에게 명시적으로 부여된 권한을 제외한 모든 권한을 보유합니다.</li>
<h3>본 계약에 따른 권리 보유자.</h3><br>
<li>본 계약은 제3자에게 권리를 부여하지 않습니다.</li>
<li>귀하는 본 계약에 따른 귀하의 권리나 의무를 당사의 동의 없이 타인에게 양도할 수 없습니다.</li>
<li>당사의 권리와 의무는 타인에게 양도될 수 있습니다. 이러한 양도는, 예를 들어, (인수합병이나 자산매각으로 인해) 당사의 소유권이 변경되는 경우 또는 법률에 의해 이뤄질 수 있습니다.</li>
<h3>유사시의 책임자.</h3><br>
<li>당사 서비스는 '있는 그대로' 제공되며, 당사는 당사의 서비스가 안전성과 보안성을 갖춘 채 제공된다거나 항상 완벽하게 작동한다고 보장할 수 없습니다. 관련 법률이 허용하는 한도 내에서 당사는 또한 상업성, 특정 목적을 위한 적합성, 권한 및 비침해성에 대한 묵시적 보증을 포함하되 이에 제한되지 않고 명시적이거나 묵시적인 어떠한 보증도 하지 않습니다.</li>
<li>또한 당사는 사람들의 활동이나 말을 통제하지 않으며, 사람들(또는 귀하)의 활동이나 행동(온라인, 오프라인 불문) 또는 콘텐츠(불법 또는 유해 콘텐츠 포함)에 대해 책임지지 않습니다. 또한 당사는 다른 사람이나 기업에서 제공하는 서비스와 기능에 대해서도 책임지지 않습니다. 귀하가 당사 서비스를 통해 이러한 서비스와 기능에 접속하더라도 마찬가지입니다.</li>
<li>서비스에서 발생하는 모든 사안에 대한 당사의 책임은 법률이 허용하는 범위 내에서 최대한도로 제한됩니다. 당사는 당사 서비스에 문제가 있는 때 해당 문제가 끼칠 수 있는 모든 발생 가능한 영향을 알 수 없습니다. 귀하는 본 약관으로부터 또는 본 약관과 관련하여 발생하는 수익, 수입, 정보 또는 데이터의 손실이나 파생적, 특수적, 간접적, 전형적, 징벌적 또는 부수적 손해에 대해, 당사가 그 발생 가능성을 알고 있었는지 여부를 불문하고, 당사는 책임지지 않는다는 것에 동의합니다. 여기에는 당사가 귀하의 콘텐츠, 정보 또는 계정을 삭제하는 경우도 포함됩니다.</li>
<li>단, 위와 같은 규정에도 불구하고, 관련 법률에 의해 위 규정에 따른 책임 제한이나 면제가 허용되지 않을 수 있습니다. 이 경우, 당사는 해당 법률이 규정하고 있는 범위 내에서 책임을 부담합니다.</li>
</ul>
<h3>분쟁 해결 방법.</h3><br>
귀하가 소비자인 경우 또는 관련 법령이 요구하는 경우, 귀하가 거주하는 국가의 법률이 본 약관과 관련하여 발생하는 귀하의 모든 청구, 소송 사유 또는 분쟁('청구')에 적용되고, 귀하는 관할권이 있는 국가의 관할 법원에서 해당 청구를 해결할 수 있습니다. 다른 모든 경우에 귀하는 해당 청구가 서울 지방 법원에서만 해결되고, 해당 청구의 소송 목적에 대해 이러한 법원 중 한 곳의 속인적 관할권을 따르고, 법 조항의 상충 여부와 관계없이 본 이용 약관 및 모든 청구에 대한민국 법이 적용된다는 것에 동의합니다. 앞선 내용을 침해하지 않는 범위에서, 귀하가 당사 제품에 대해 악용, 방해 또는 무단 사용을 시도하는 경우 HINPL Inc.는 단독 재량에 따라 귀하가 거주하며 청구의 관할권이 있는 국가에서 귀하에 대한 관련 청구를 제출할 수 있음에 귀하는 동의합니다.
<h3>요청하지 않은 자료.</h3><br>
당사는 피드백 또는 기타 제안을 언제든 환영하지만, 이를 어떠한 제한 또는 보상 의무 없이 활용할 수 있고, 이를 기밀로 유지할 의무가 없습니다.
<h3>약관 변경</h3><br>
당사는 요기콕 서비스 및 정책을 변경할 수 있고, 요기콕 서비스 및 정책이 정확하게 반영되도록 하기 위해 본 약관을 변경해야 할 경우가 있습니다. 법적으로 달리 요구되지 않는 한 당사는 본 약관을 변경하기 전에 귀하에게 알리고, 변경된 약관의 효력이 발생되기 최소 30일 전에 귀하에게 이를 검토할 기회를 제공합니다. 변경 발효일 이후에도 귀하가 계속 요기콕 서비스를 이용하실 경우, 귀하는 변경된 약관의 적용을 받게 됩니다. 본 약관 또는 개정된 약관에 동의하지 않을 경우에는 <a href="deleteaccount.jsp">여기서</a> 귀하의 계정을 삭제하면 됩니다.
개정: 2022년 1월 4일


</body>
</html>